import mestia from "/src/assets/images/mestia.png";
import akhmeta from "/src/assets/images/akhmeta.jpg";
import dusheti from "/src/assets/images/dusheti.jpg";
import kazbegi from "/src/assets/images/kazbegi.jpg";
import lentekhi from "/src/assets/images/lentekhi.jpg";

const settlementsInfo = [
  {
    "first-header": "მესტიის მუნიპილიტეტი",
    "second-header": "სამეგრელო-ზემო სვანეთი",
    settlements: `დაბა მესტია; ბეჩო — ბაგვდანარი, გალაში, დოლასვიფი, დოლი, ლანხვრი,
              მაზერი, ნაშთქოლი, ტვებიში, უშხვანარი, ქართვანი, ცხეკვანი,
              ჭკიდანარი, ჭოხულდი; ეცერი — ბარში, გვალდერი, ისკარი, კალაში,
              ლადრერი, ლანტელი, ლაშხრერი, უსგვირი, უღვალი, ფხუტრერი, ქურაში,
              ცალანარი, ჭელირი, ჰებუდი; იდლიანი — იდლიანი, ლებურცხილა, ნაშიხვი,
              ჭალე; იფარი — ადიში, ბოგრეში, ზეგანი, ნაკიფარი; კალა — დავბერი,
              ვიჩნაში, იფრარი, ლალხორალი, ხალდე, ხე; ლატალი — იენაში, იფხი,
              კვანჭიანარი, ლახუშდი, ლაჰილი, ლელბაგი, ლეშუკვი, მაცხვარიში,
              ნანყვამ-ზაგრალი, სიდიანარი, შყალერი; ლახამულა — გენწვიში, დიზი,
              თოთელეში, ლახამულა, ნოდაში, ნოღარი-კეცლანი, ქვედა იფარი, შდიხირი,
              ხელრა, ჰამაში; ლენჯერი — კაერი, ლაშთხვერი, ლემსია, ნესგუნი, სოლი,
              ქაშვეთი, ჰეშკილი; მულახი — არცხელი, ზარდლაში, ლახირი, მაჯვდიერი,
              მურშკელი, ჟაბეში, ჟამუში, ღვებრა, ჩვაბიანი, ცალდაში, ჭოლაში; ნაკრა
              — ანილი, თავრალი, კვიცანი, კიჩხულდაში, ლაშხრაში, ლაწომბა,
              ლენკვაში, ნაკრა, ცალერი, ხერხვაში; უშგული — ლამჯურიში, მურყმელი,
              ჟიბიანი, ჩაჟაში, ჩვიბიანი; ფარი — ზაგარი, ზედა ლუჰა, კაცხი,
              ლამხერი, ლაყვრი, სვიფი, ფალედი, ფარი, ქვედა ლუჰა, ღეშდერი, ყვანა,
              ხოსრარი; ცხუმარი — ლაბსყალდი, ლეზგარა, მაგარდელი, სვიფი, ტვიბერი,
              ღვებალდი; წვირმი — ასკარტი, აცი, იელი, ჩობანი, წვირმი; ჭუბერი —
              დევრა, ზედა მარღი, ლარილარი, ლახამი, ლეკულმახე, ლეწფერი, სგურიში,
              ტიტა, ქვემო მარღი, ყარი; ხაიში — ბარჯაში, გაღმა ხაიში, ზედა ვედი,
              ზედა წვირმინდი, ზედა ხაიში, ზემო ვედი, თოთანი, ლალხორალი, ლახანი,
              ლუხი, მუხაშერა, ნაკი, ნალქორვალი, ნანყბული, სკორძეთი, ტობარი,
              ქედანი, ქვედა ვედი, ქვედა წვირმინდი, შგედი, ციცხვარი, ჭერი, ხაიში,
              ჯორკვალი.`,
  },
  {
    "first-header": "ყაზბეგის მუნიპილიტეტი",
    "second-header": "მცხეთა-მთიანეთი",
    settlements: `დაბა სტეფანწმინდა - ცდო, გველეთი; სნო - აჩხოტი, კარკუჩა, ახალციხე, ჯუთა, ქოსელი, ართხმო; სიონი - არშა, გარბანი, გაიბოტენი, თოთი, ფანშეტი, ვარდისუბანი; გორისციხე - ხელშე, ტყარშეტი, ხურთისი,  ყანობი; კობი - უხათი, ალმასიანი, ნოოგყაუ, ქვემო ოქროყანა, შევარდენი, მნა, აბანო, კეთრისი, ტეფი, გიმარა, ცოცოლთა, ბურმასიგი, კარათსოფელი, დესი, სუატისი, რესი, ზემო ოქროყანა, გუდაური - გუდაური, განისი, ერეთო, სოკურიანი, ფალაგყაუ, ქუმლისციხე.`,
  },
  {
    "first-header": "ლენტეხის მუნიპილიტეტი",
    "second-header": "რაჭა-ლეჩხუმი და ქვემო სვანეთი",
    settlements: ``,
  },
  {
    "first-header": "ახმეტის მუნიპილიტეტი",
    "second-header": "კახეთი",
    settlements: ``,
  },
  {
    "first-header": "დუშეთი",
    "second-header": "მცხეთა-მთიანეთი",
    settlements: ``,
  },
];

const images = {
  0: mestia,
  1: kazbegi,
  2: lentekhi,
  3: akhmeta,
  4: dusheti,
};

export { settlementsInfo, images };
